{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.2.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_1/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_2/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_3/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5000"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "256"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_4/reduction_indices", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/concat/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup", "op": "GatherV2", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "input_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT64"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max", "op": "Max", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/BiasAdd", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_1", "op": "Max", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/BiasAdd", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_1/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_2", "op": "Max", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/BiasAdd", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_2/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_3", "op": "Max", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/BiasAdd", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_3/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_4", "op": "Max", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/BiasAdd", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_4/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_1", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_2", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_3", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_4", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "5"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/concat", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/Relu", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/embedding_table/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/conv1d/ExpandDims_1", "shape": [1, 2, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/conv1d/ExpandDims_1", "shape": [1, 3, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_1/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/conv1d/ExpandDims_1", "shape": [1, 4, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_2/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/conv1d/ExpandDims_1", "shape": [1, 5, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_3/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_3/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input/_20", "shape": [5000, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/MatMul/ReadVariableOp", "shape": [128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/conv1d/ExpandDims_1", "shape": [1, 6, 256, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/conv1d_4/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/global_max_pooling1d/Max_4/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/MatMul/ReadVariableOp", "shape": [320, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/classifier/sequential/dense/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}]}]}